n5/src/Catalogs/Assistants/Assistants.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Assistants</name>
  <attributes>
    <name>CodeInterpreter</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Model</name>
    <type>
      <types>CatalogRef.AIModels</types>
    </type>
  </attributes>
  <attributes>
    <name>Provider</name>
    <type>
      <types>EnumRef.AIProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>Purpose</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Retrieval</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Search</name>
    <type>
      <types>EnumRef.InternetSearch</types>
    </type>
  </attributes>
  <attributes>
    <name>Server</name>
    <type>
      <types>CatalogRef.Servers</types>
    </type>
  </attributes>
  <attributes>
    <name>Temperature</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Files</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Login</name>
      <type>
        <types>CatalogRef.Logins</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Instructions</name>
    <attributes>
      <name>Instruction</name>
      <type>
        <types>CatalogRef.Instructions</types>
      </type>
    </attributes>
    <attributes>
      <name>System</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/InformationRegisters/Assistants/Assistants.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Assistants</name>
  <resources>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Synced</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Assistant</name>
    <type>
      <types>CatalogRef.Assistants</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Catalogs/Assistants/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure Unsync ( Ref ) export
	
	r = InformationRegisters.Assistants.CreateRecordManager ();
	r.Assistant = Ref;
	r.Read ();
	if ( r.Selected () ) then
		r.Synced = false;
		r.Write ();
	endif;
	
EndProcedure

Function FindByID ( ID ) export
	
	q = new Query ( "select Assistant from InformationRegister.Assistants where ID = &ID" );
	q.SetParameter ( "ID", ID );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, undefined, table [ 0 ].Assistant );
	
EndFunction

#endif
